#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.example must be replaced
-/+ resource "azurerm_kubernetes_cluster" "example" {
      - api_server_authorized_ip_ranges = [] -> null
        dns_prefix                      = "exampleaks1"
      - enable_pod_security_policy      = false -> null
      ~ fqdn                            = "exampleaks1-fbfa44c9.hcp.norwayeast.azmk8s.io" -> (known after apply)
      ~ id                              = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourcegroups/devops-training-team1/providers/Microsoft.ContainerService/managedClusters/example-aks1" -> (known after apply)
      ~ kube_admin_config               = [] -> (known after apply)
      + kube_admin_config_raw           = (sensitive value)
      ~ kube_config                     = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUUvVENDQXVXZ0F3SUJBZ0lSQVBaZ1pTRVo2a3BiaTZpa0pNNkFPR3N3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdIaGNOTWpBd016RTRNVEV3TlRNM1doY05Nakl3TXpFNE1URXhOVE0zV2pBdwpNUmN3RlFZRFZRUUtFdzV6ZVhOMFpXMDZiV0Z6ZEdWeWN6RVZNQk1HQTFVRUF4TU1iV0Z6ZEdWeVkyeHBaVzUwCk1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBdUJhdEdyS3JtMkR5QWZZL2FxRnoKSStUdUwxT2Vaak1hdnJMaXdDV0FEdDFNUW10VGIrTEM5NUUwTzgzUGc5N1czZWQ2T2NYRGRSQWprTDIwaTNZZQpOWG5IZitFM2RGaXRGaWVoMzhMYUhsZlF1Tkg2cG8vUllLV2oxWjFPeFE2Mk1wYmlyaHZJUFd5THNOT05McEppCjF0Q2pkczdUbEVJbEloZ0tuMkdOZm5ES09uQk5JUnYzV3lrQ3c0WEozc2d4ak0xSU1ZemVNUk5PMkk2ZXV5MDUKRzJEc1k5WkYyN1NkZ1VCTmsxN1A3cHY2RmdyNmMvQmh1LytaWUJIVEoyRkpGWG1YN09maEVWbFBYVnp4RmhLNQpNMzhaUjR0YWEvakJPeXMzMldQK09tRXQ3NVlIRGJ4RU83OThZZW9sdHA5eFg4aEJpWHlna3dsOGt2MlU2KzBGCnNmVUtNRkZ6YlBWUncrV21kcVJJTEkrUnlidSs3aFJWLzZWMVlNYU9EUDk4SnoxLzZzekFHSzFNd0J5cDV1dGgKTGhlVVgrK2dRRG8yVFRMKzJrU3AyMlQ4Q0V6bVNrYm9xYXNjVnN5UmU1b0pXNEluSGZock9aaGdOa0syWlhzVgplYzNKTzExV1gxekRwTnlSQ0pEakZ0VnFrOS9RWXhlU0VwTHY3S0tNcUh2TEtUN1VpZHBRMld5S2xKRCs4OE9iClpveWJIblZXOXVGY1pKLzR3NVdiWDZrL0hxb2taVU85Nk1Db1AyMFFmMGJhS0huN3VlSXVlWVhJQjhMb0NiOEMKZVB6RmVUTlRYZFpUdDJhWDVrWXlWWGJlanN4cXY2TXN4d0FCdEErOFQvQmRwbHlkTElqRFRxcCtHVVpYV1VsRApGNTRjcDhyVWJyYm1mU1J6VVA2eUVVVUNBd0VBQWFNMU1ETXdEZ1lEVlIwUEFRSC9CQVFEQWdXZ01CTUdBMVVkCkpRUU1NQW9HQ0NzR0FRVUZCd01DTUF3R0ExVWRFd0VCL3dRQ01BQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUIKQUI5ZGFoZEhCOHg2YzBzL3Fkcy95Y05NMnZySG5oK0FHMlZydmpuQVVyTDRoZ3owK1FkZmVMWUJtN3lqQVZjYQpSZ0pISlN4WFRGcDFmYnFwSDl2d0dxK2N3Z3owbFlTZEZ4VDA3c0Q0aVNKNUFzWXZqTVRKTjNTN2VxWkVjMzRpCnpKREpOd1lzOUhibWtOV3V4SG5DNVBWTDROSzZKMUl0RHNOVUVOZTVKdGlkOFMvWG9wYjNlL2V3SFBneVM1MDIKMDJLRU5QWmJsMGtIcU54NEFDaTJWV1p0MGNRYU5QNkZVSnBYZjkvL3ptN1NGVjVNd2gvL2lxa2V4R3Q3aHo2Ugo3b3dLTDYzS3pLZUtyQmk1MTVWWlJ2ZndjRzZaSWxScVdFWXlHeFlQeDhqTUxwN01GZThHMi9kKytSYmRKamUyCmpyZ2NkYVNzUkIwRHp2V0dQWU4xbTluaTFkNTFubG8xTDhtTDVxcVdNWko2R2I1cUFrNSs1c0t3eGZua3hWczMKOG05VXQvM3ZMQ2MxdzJ0OVRqNDVxSjk3L01pN3FCMHdZOUZRRGpTeWVhODBId3ZWR3IyejZ6ODkzOXVxZzg3MApIZ1EzVHRkc2MyVVZ3emJtY2dlWEFMODgzcGxoUmZ3MGJuUXlrN0xrdUIzbTJ0Tzd5emVjUlBxMm11cTB3OVlrCi9HZEhKV0VHTU5Pc3dOc2lkWTlKTjQyNTJoSFBaeDB3MGR4M3RDRW1NKzNKb2xQb1g0Y2VKNVMxSFNyN0RTQjUKRzgxRDNqRDBWcjE3a01tQk45ejBDeE1yVjFaam9GOVp2ejg1aTlETlNORTYyZjNSTmdjTERjejJ5eEFqSmllcgp0NVNobHZWZkljQzNEdCtIWXhuMVNYQzdiRHdGWVpOaE41ODhBMVZWVEQyRgotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS1FJQkFBS0NBZ0VBdUJhdEdyS3JtMkR5QWZZL2FxRnpJK1R1TDFPZVpqTWF2ckxpd0NXQUR0MU1RbXRUCmIrTEM5NUUwTzgzUGc5N1czZWQ2T2NYRGRSQWprTDIwaTNZZU5YbkhmK0UzZEZpdEZpZWgzOExhSGxmUXVOSDYKcG8vUllLV2oxWjFPeFE2Mk1wYmlyaHZJUFd5THNOT05McEppMXRDamRzN1RsRUlsSWhnS24yR05mbkRLT25CTgpJUnYzV3lrQ3c0WEozc2d4ak0xSU1ZemVNUk5PMkk2ZXV5MDVHMkRzWTlaRjI3U2RnVUJOazE3UDdwdjZGZ3I2CmMvQmh1LytaWUJIVEoyRkpGWG1YN09maEVWbFBYVnp4RmhLNU0zOFpSNHRhYS9qQk95czMyV1ArT21FdDc1WUgKRGJ4RU83OThZZW9sdHA5eFg4aEJpWHlna3dsOGt2MlU2KzBGc2ZVS01GRnpiUFZSdytXbWRxUklMSStSeWJ1Kwo3aFJWLzZWMVlNYU9EUDk4SnoxLzZzekFHSzFNd0J5cDV1dGhMaGVVWCsrZ1FEbzJUVEwrMmtTcDIyVDhDRXptClNrYm9xYXNjVnN5UmU1b0pXNEluSGZock9aaGdOa0syWlhzVmVjM0pPMTFXWDF6RHBOeVJDSkRqRnRWcWs5L1EKWXhlU0VwTHY3S0tNcUh2TEtUN1VpZHBRMld5S2xKRCs4OE9iWm95YkhuVlc5dUZjWkovNHc1V2JYNmsvSHFvawpaVU85Nk1Db1AyMFFmMGJhS0huN3VlSXVlWVhJQjhMb0NiOENlUHpGZVROVFhkWlR0MmFYNWtZeVZYYmVqc3hxCnY2TXN4d0FCdEErOFQvQmRwbHlkTElqRFRxcCtHVVpYV1VsREY1NGNwOHJVYnJibWZTUnpVUDZ5RVVVQ0F3RUEKQVFLQ0FnRUFoNzNJMVFmc2ZEMUhGbVZDcTlqeTh3UExFa0RCYXpEQnh0NVhUMElYcEY1UDdpWC90MS9wVGUzWApLMFgrZjRtZ3ZLNEVOWGQ3UWVXdG8vd09sa3Q1eVFyTUxhS2ZabjVBMnpaTUtaZ2ZpQUpPMlFtVW5wOHJ6KzB6CjJyOE5KMGRLMkJEa2cyZmZCbFAweVdXbEZETkRDSTErQzR4RS9XeXN2dkFsWFJMczU5QTVmay95djdoRWRBYlEKaitZbVRjMG1wR0YybTNyNUdBelp0ZHVzZGU3SnprTnc2OGxEWjlkTjBOSGVvZzFtbTlhTjJSVXRTckoxRHRCUgpnMEtCaGVjNW9ja3dXck05QmJMcVQ3akoyUEhqZUhKKzdIOTRKR2VmN0laWXYwYjVYb2pyKzErUVFmT1NDTkNRCjRnNXEwcmZOUE1pSWN0M2Y5YXdvSEtjNTJhSEQ4UTFDTjh6c01yYnEyM1Y3VlB4VU5KcVFndkNJd0pESjZxb0kKWHRVaVl0aEEyQXFVUVpKZmt5UjNTOGtqWVR1NDJpSStrakJ2Sk00UGZzRkFlWUhtZHR4SG9vb1ZWdi9pSk9CMQpsM1cvT2MwZlk4bytSOStSQVUwUlFiUXF0SWNDMTlKY3lHaXJuUk5LeHdZWXh1bEtLL0U3VWJncXNuZU1XTFM4CnprdHBMSjE2RkhZR3dBWVZxR3JDNGN6KzVWMEp0aG9yVkxtMmZSajREYmg0QnRyeWdJcmROclBlN2N3dGlSUHcKMFJNNnV4dmhZbkNWNHpYemlmYitaSDJKOFZTZGk1OGNVajdhMmxrMUxWWTZ1d01FbTFSbXpKM0NOc0Q4K0ZSbgpoTHRoUlRONWVFQ05NKzF2L1dIa2crd0d4cUJWa2NDYUFadGNNTVNSR1VZZ25YRU9EWDBDZ2dFQkFPWWE3VEFVCnhwSkczcFR4Qys1RlVtcTYzZmpSM0NRaytVTldNbGN5NlB1aWlYcE4yOTlZRndGMmg3dURpWk1Yck1Pbmdld2UKVXhsc1F5RVV3cVRtTEdvUkFKZTQzOHNuaG9tMG5abkZzQ2JRSmpxMDZFQnZWekZoOTUxaUM4WUJEbFI1MVBieAowbzRWWS9xQXhMQnRubWM0SDY4bStVckMxS3BJblhxV0pFRVl4ZDNzZk42NkJnMkdxRjBPdTFFc3ZFTHNHb1hwCnJWNHlSV2ViaXBtQmlaS1pZajJCdFdiRXllTXU4MU9Ca0JrK3hacG8xYk51Ri9VSHFaZ3EvMWRPbTVmYUR4SnEKV09MRnZSUVFRbk1SRE43WVFpS3ZGSkk1U0s0anFCODN2MHkvSGIvZGZ5R1dzdGFHcVAxRUdaaHpSODRFTFQwUgphTWM4L1dYVnNDSUQ0TzhDZ2dFQkFNek9FQTBycGR0RlV5YXZXcVBvbis1b1QvLzBXU2VOZ1hSS3U0a2NjMW9PCnIwakZBUDg3UVpCUnh1Zk9KTnVDbTNuQml0S0JFOUhXNmNSeXlMZGl6S2hzWDd5NHZTVFZOMFNzVjRoVi9mbTQKUks1R1hMTEFMQXdiWEZ6RFBSTjMwU20xRGVTUCtDcVE1S3BiUUM4aGpxN1hOZWtYUDJCclNiU3dJUnFsMzRHbgpGc3JpN0NrWjgzK0F5cUlzeDNxWnY2eWduZzg1K0x2ejJ6clFHMlN0SVRSZmJpelFSMWxTOVh2dW9YZmV3VFFaClc3WVpKQW9EMENCQ0EvT1VOVjZ2M1MzSXJBSEVFdURMSWxrT1U2TnBsNVdVOEZ6QnF1UHNsWGU5WUY3OXZITlYKcWNUZWpHYlhTSXdUUUZSMkJ2UkkxNjIvaGNoT0g1UERLOTVlakdaUkNRc0NnZ0VCQUxRdGYyNTN4aWxDRHdZSApYWFU4bU5WejcxM25UZjZMYVJjZUJwc2JCUzRNenFPVEZjamtIRmVMN2FxWnkvNyt1Y3dXZlBoYm9tdzB4cmUvCm5zNHFZYnJJQjNQR1VvNnNLMy9taXNXZTgxamhBaDVVQzh4d29wRExpbTJWR1d6NDVMU25GV2dzWU5mYXpnZVkKRHV1cldpNnUxcmg2eHhlUVNaL3c3a2JRRENGZytZYlZwODFyVWxRRERoQ1grWHNOa1hqQmtkOHI1Qkh2UVVObwptdldxWmdRQjBOZ2ltZDJYMkJIcGNLVUJ2Y2pXeXpvbVByZWFURzRVaXVyWk9FbXdCc3UzOXJkUHlMd0JaQld5CnlhVjZRMTYzYmNuazJESExZeXJnUnNQekRmdFZaMEVXZW5iZG5ybTJoZHFUR1l1ek1SV1RWYTBNMWNPMDhTSnQKV2RhNHZNY0NnZ0VBTThtM2pWMElKNVkwSElnaTUyZWZhVzIvTFAzZ3ZYdXV6SFZKVHJaL0JMcko0Q0RReTdsMApMc1kvQWNiQzB5OEhtWll6UUYrYlgyaDAzRlFhSlNVNmt5dzBXVWh0cTY2dXR4TE5YNUEvRkxKZnk2SEhOdndaCkowYVQ2SEVHTkxJTGxmeE9jd2xrdTM3QUU4UFhTeE8xUE1qMnZPWkFCR1djMGEvbjd4RWFuM0pjOVJqRWx2QVUKL3B6V29JT3FQWG83V2ErVHlFM2tjOEtLSVNrV2hES3pQc2NTMlFvaHdKaVZzcXo0NzVMSVVDQkpiSmFXNG1GcwpjM3U5L0EzeUlPdGZob0JEM241eU41Mm1KZGJWbDNEUC8rY1ZrSjc0VTRJem1YK3RxdGVHbTdPQnBtS1FKa0V4Cit4bXpIcWhwd2NQWnBmblVIbjZDeFo2SXJVWkRRbXdqV1FLQ0FRQm5DWmlyalVJckJ2aWtsUmROWWtGYzFrUzQKVEZIdEpJYjRDRmUvRlFQM0NudWRlek5zalNuNFEwS05zWGxCMjZIS01KTEtYSk1aUkVkSzFtQzg5UkYwM0tWeQpKTTZ6WEp2ekdFWHVBN0c4R25aWldSOHpEdzNJaXFpalgxRXlpUklXWlB5T3JXN3laendWaTRSdVlrRGo5QWFZCk8weDBMc3dBenBLUWJZczZtb2VjM3lFR1ZFeVVXaEgvR21SSUowaHpTL1ZlNmJMaFlOU0M4T01zWlJKcHNMbGQKUHRlOU56NFIrZWpSdkQydnRiZFZIZXVkMTFoK2lRcVgvY1h5aUpXWG02REhaTlZhUjNNVm5yd2x6bGZGSGZNKwpvUHhiMHVLTnJ0S2ljREpEZDBSeG5uL1Y5MDhEYThsZTdNbzc1L3ZvZWs4UUw0RGFhMTBLV0o5R0ZBRkoKLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K"
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5VENDQXJHZ0F3SUJBZ0lRZVZvMm1rbytibW0ycmhSVEdURk9NREFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWdGdzB5TURBek1UZ3hNVEExTXpkYUdBOHlNRFV3TURNeE9ERXhNVFV6TjFvdwpEVEVMTUFrR0ExVUVBeE1DWTJFd2dnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUURaCkRjajZiMmJFYVE3aTZrb1F4WkREaG1kZXJweHpOamRiYTdGQTZhNWhaNzNLZU9NSUpWTkh2N3FMOXFjK2pPS2cKenpEd0V4WXMxVWtvcnhCVUYwcGlzMkY2Y3k4NURHL1FyKzZoVGRoNytrSkVoNy9mMVZlaG5hMTU3OXoxdXVFTgpYS3NSZFNZYTFweFN3ay9nMllmWjdScDErWkdFYkRwcU5LVkYwNEpLU1JDbTdERUszUklYcWd4djJYb2VvYnRTCkl6MEZwbXpsOGQyQkpKRGxrNGJSZzVMQ0N3ZlA4ZkdscXg0OGF0eU5aN0R3WVJLNHducVQvcG83R2VvajArb0YKaTl0aFFId3RLVlJrZGVhcGlsbnVrYkdYTHdvZWp4d2t4aXh6R3ptRU1pbllmWEJGeG5HcC9IQmRCMTYzdTFJbwpWYktHMlI2cDI2UmxwZ1RPNmFYbWt1ZEd5bzRFU3k4bVk4bVNocHczS1ZYeGVYT3lHTHhvb0pPdkdOYkFicHJmCmdjTUN0VEFaSGR6N2VFTjF5WDlyVzVOczN6cWQxYkNKTzVhWnYxeit2dlNxZUNUVytaS2E0QXdzUmRzNU5ad2MKTTNJMVJaSW9HWUFJWi9KOEUvbmtwN2ovNjE1Z3F6T3ZnSTkwaWs5WFNwenVZUjAzWlFadExscGRrM0dJRm9nNQpBTTVzVGtHSzBZZmwxcWhMekJlZnE5dHZuYXlvUUpoRlZMZ2NIb0lpWHVHcTEwL1pRNnc3SDAyK2lKeGFMOGpFCkFIT1FyUVp4UTJLVGF4bnBvU2FWVFhjOUdYelZETWRJMElvYVMzVHF4NXlQQVVyVUIvV0tER0pkdFB4WDY1TWkKKzFmdTlZdnFVdWVaUVJxT1FnZVJJM0xrZTlkeDFrOW4za0haMGM4MVlRSURBUUFCb3lNd0lUQU9CZ05WSFE4QgpBZjhFQkFNQ0FxUXdEd1lEVlIwVEFRSC9CQVV3QXdFQi96QU5CZ2txaGtpRzl3MEJBUXNGQUFPQ0FnRUFBOGtYCmx5cUhOeUV4eCs3bEpJRWw3dGZWNEp2Si9Lb0lsc1Q2QWFGUzBRdWFVUHdkSG1LQ2ZzNDNQRDJXYnJwbldaZkUKRkl2Q0Nnd1luZ3ZhZ2pyWGkzMmNZMmxlWm41VThmLzVKM09VU0o3MWt1YlZodFhlbnhocHRMVGR4ODh3WWF5WAphZ2ZrMVkrN0RXMmpTTFhVdzdoQzBZWWdaTk5RcVNxNjYzQTc2KzBWbmw0NWJBWVlZVWVsTkFKdnRia3RwdndECktjVElZOVlnZ2hmcTMvd0p0ZzR5RlF6V1QxR1ZLVXJwRXNwUi9tY2VqNk9ObnlwMnNNTEdiT0dHbkJXZUkySHcKWW1EakR0bW1sZEVmeXk1RGRHcUhhMTh2M0dtUkxWc2VQTHpTNHN2VzhsZys0MWYwQjVxVEtHTGQrQm5Lby9NbwpPbDNRQ2NUay9tVHl5ak1xNjlpaVlHVSsrSERFRGc3UDArTG84L2tQSkZSdE8xei9rZFVoNm5Id1YxZ2hiZitaCkgxQ24yUzg2RDB6K3NqeWFydTdLRU53U3R3OW5vT3hWNXlzY2xBSi9mSUVjV2p4K3QvTGlMN2sxRXdJV0ZzOGEKdUk2LzE3aTRxSCtvdmlnV1dWbloxYUVIZVJDZnFrK3hGUC9DOWJtNmJQQlowUFBFMXNWWE5aTkZDOUxjajdmSQpzNy8yRkw3QTNFdTZRdXgyK05GbnIzZXlicEZ0OUpBNWdMQzdPcElYWXd1M014VTlwOTBLRmJ0OVRHRG5PeGY2CmhWdTQxWjVSSGFjWE5FMXJIRDNWUlhORWxFb3lzZnl1eXhjcVRVQjZ0Qk9wbXZ4SjdBMkp6cnNpcHdQNDNlcHEKcURCcFJpQ0pDWlEyNFNtUWdCaTFkV2huU0liM2FMOTIvR3I2ZCtvPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://exampleaks1-fbfa44c9.hcp.norwayeast.azmk8s.io:443"
              - password               = "e25c98512be0533e9fae3b0e7f8bdbd555687aee99a1bcd714aef1adb97c0fce6ad0dfc529ffe47899ec2c3b22ed1a49887bc45f4e9609082bd169928c26f807"
              - username               = "clusterUser_devops-training-team1_example-aks1"
            },
        ] -> (known after apply)
      ~ kube_config_raw                 = (sensitive value)
      ~ kubelet_identity                = [] -> (known after apply)
        kubernetes_version              = "1.14.8"
        location                        = "norwayeast"
        name                            = "example-aks1"
      ~ node_resource_group             = "MC_devops-training-team1_example-aks1_norwayeast" -> (known after apply)
      ~ private_cluster_enabled         = false -> (known after apply)
      + private_fqdn                    = (known after apply)
      ~ private_link_enabled            = false -> (known after apply)
        resource_group_name             = "devops-training-team1"
        tags                            = {
            "Environment" = "part1"
        }

      ~ addon_profile {
          - aci_connector_linux {
              - enabled = false -> null
            }

          - azure_policy {
              - enabled = false -> null
            }

          - http_application_routing { # forces replacement
              - enabled = false -> null
            }

          ~ kube_dashboard {
              ~ enabled = false -> true
            }

          - oms_agent {
              - enabled = false -> null
            }
        }

      ~ default_node_pool {
          - availability_zones    = [] -> null
          - enable_auto_scaling   = false -> null
          - enable_node_public_ip = false -> null
          - max_count             = 0 -> null
          ~ max_pods              = 110 -> (known after apply)
          - min_count             = 0 -> null
            name                  = "default"
            node_count            = 1
          - node_labels           = {} -> null
          - node_taints           = [] -> null
          ~ os_disk_size_gb       = 100 -> (known after apply)
          - tags                  = {
              - "environment" = "part1"
            } -> null
            type                  = "VirtualMachineScaleSets"
            vm_size               = "Standard_D2_v2"
            vnet_subnet_id        = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/team1-vnet/subnets/Kubernetes"
        }

      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          ~ docker_bridge_cidr = "172.17.0.1/16" -> (known after apply)
          ~ load_balancer_sku  = "Basic" -> (known after apply)
          ~ network_plugin     = "kubenet" -> (known after apply)
          + network_policy     = (known after apply)
          ~ outbound_type      = "loadBalancer" -> (known after apply)
          ~ pod_cidr           = "10.244.0.0/16" -> (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
            }
        }

      ~ role_based_access_control {
          ~ enabled = false -> (known after apply)

          + azure_active_directory {
              + client_app_id     = (known after apply)
              + server_app_id     = (known after apply)
              + server_app_secret = (sensitive value)
              + tenant_id         = (known after apply)
            }
        }

        service_principal {
            client_id     = "d3791396-3ca2-49ff-8ea8-7ace393c4b8b"
            client_secret = (sensitive value)
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }

  # helm_release.traefik will be created
  + resource "helm_release" "traefik" {
      + atomic                     = false
      + chart                      = "traefik/traefik"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "traefik"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "traefik"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "8.2.1"
      + wait                       = true

      + set {
          + name  = "logs.loglevel"
          + value = "INFO"
        }
    }

  # kubernetes_ingress.nginx_ingress will be created
  + resource "kubernetes_ingress" "nginx_ingress" {
      + id                     = (known after apply)
      + load_balancer_ingress  = (known after apply)
      + wait_for_load_balancer = false

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + backend {
              + service_name = "scalable-nginx-svc"
              + service_port = "80"
            }

          + rule {
              + http {
                  + path {
                      + path = "/my-local-chart/*"

                      + backend {
                          + service_name = "scalable-nginx-svc"
                          + service_port = "80"
                        }
                    }
                }
            }
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Warning: "address_prefix": [DEPRECATED] Use the `address_prefixes` property instead.

  on main.tf line 17, in resource "azurerm_subnet" "Kubernetes":
  17: resource "azurerm_subnet" "Kubernetes" {



Warning: This resource is deprecated and will be removed in the next major version. 
Please supply the URL of your repository to helm_release resources directly, using the repository attribute.
See: https://www.terraform.io/docs/providers/helm/r/release.html#example-usage

  on main.tf line 221, in data "helm_repository" "traefik":
 221: data "helm_repository" "traefik" {


```

</details>

*Workflow: `Terraform validation`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./Oppgave2`, Workspace: `default`*
